# StructuralBottomReleaseMx Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBottomReleaseMx Property
ParameterTypeId Class See Also
---
"Base Mx"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBottomReleaseMx { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBottomReleaseMx As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBottomReleaseMx {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace